swat-dp-tools/soma/xml/domain-backup.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <dp:request xmlns:dp="http://www.datapower.com/schemas/management" domain="@domain.name@">
            <dp:do-backup format="ZIP" persisted="false">
                <dp:user-comment>Swat4DP Domain Export</dp:user-comment>
                <dp:domain name="@domain.name@" />
            </dp:do-backup>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>